# Задание: Напишите программу на ассемблере RISC-V, которая заполняет массив из 16+n целых чисел значениями из стандартного ввода. 
# Программа считывает значения в цикле и завершает чтение, когда считаны все 16+n значения 
# или когда считано значение 0 (n – номер студента в группе)

.data
arr: .space 68 # Размер массива (4 * 16 + 4), резервируем место для элементов
n: .word 1 # Анисимов Иван Александрович, вариант 1

.text
main:
    la t0, arr # Загружаем адрес 0 элемента массива
    
    lw t1, n
    addi t1, t1, 16 # Получаем длину массива в t1
    
    mv t2, zero # Обнуляем счетчик t2
    
input:
    bge t2, t1, init_output

    li a7, 5 # Reads an int from input console
    ecall
    
    beqz a0, init_output # Проверка на ввод 0
    
    sw a0, 0(t0) # Записываем значение по адресу t0 + 0
    
    addi t2, t2, 1 # Увеличиваем счетчик на 1
    addi t0, t0, 4 # Увеличиваем адрес на 4
    
    j input

# Решил добавить вывод для наглядности    
init_output:
    mv t3, zero # Счетчик для вывода 
    la t0, arr # Загружаем адрес 0 элемента массива (снова, для вывода)

output:
    bge t3, t2, end
    
    lw a0, 0(t0)
    li a7, 1
    ecall
    
    li a0, 10 # Загружаем \n
    li a7, 11 # Вывод char
    ecall
    
    addi t3, t3, 1
    addi t0, t0, 4
    
    j output
    
end:
    li a7, 10 # Exits the program with code 0
    ecall